Store/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Store/src/Documents/ПоступлениеТоваров/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТабЧасть = Элементы.Товары;
	ТекущиеДанные = ТабЧасть.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	СтрокаСообщения = "Изменилась колонка Количество";
	
	РасчитатьСуммуВСтроке(СтрокаСообщения, ТекущиеДанные);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РасчитатьСуммуВСтроке(ТекстСообщения, Строка)

	//Что то изменили
	Строка.Сумма = Строка.Цена * Строка.Количество;
	Сотрудник = ОписаниеСотрудника();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (Сотрудник.Имя);
	Сообщение.Сообщить();

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = (ТекстСообщения);
	Сообщение.Сообщить();

КонецПроцедуры

&НаКлиенте
Функция ОписаниеСотрудника()

	Пользователь = Новый Структура;
	Пользователь.Вставить("Имя", "Антон");
	Пользователь.Вставить("ДатаРождения", ТекущаяДата());
	Пользователь.Вставить("Стаж", 14);
	Пользователь.Вставить("Штатный", Истина);

	Возврат Пользователь;

КонецФункции
#КонецОбласти
